Revit 2027 API
Dimension.References Property
 Returns an array of geometric references to which the dimension is attached.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReferenceArray References { get; }
Public ReadOnly Property References As ReferenceArray
	Get
public:
property ReferenceArray^ References {
	ReferenceArray^ get ();
}
member References : ReferenceArray with get
Property Value
ReferenceArray
See Also
Reference
Dimension Class
Autodesk.Revit.DB Namespace